#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_iam_policy.deployment: Refreshing state... [id=arn:aws:iam::659077917555:policy/HomepageApiDeploymentPolicy]
aws_iam_role.lambda_exec: Refreshing state... [id=lambda-default-execution-role]
aws_acm_certificate.api_cert: Refreshing state... [id=arn:aws:acm:us-west-2:659077917555:certificate/ea9e3f63-d6ff-4971-b5d2-eafd528116ab]
aws_iam_role.frontend_deploy: Refreshing state... [id=gh-oidc]
aws_apigatewayv2_api.homepage_api: Refreshing state... [id=lf1d3vv0e4]
aws_iam_role.backend_deploy: Refreshing state... [id=homepage-backend-deploy-gha-oidc]
aws_dynamodb_table.visitor_counter: Refreshing state... [id=homepage-visitor-table]
aws_iam_role.api_gw_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-logs-role]
aws_iam_policy.deploy_site: Refreshing state... [id=arn:aws:iam::659077917555:policy/HomepageDeploymentPolicy]
aws_iam_role_policy_attachment.terraform_deploy: Refreshing state... [id=homepage-backend-deploy-gha-oidc/arn:aws:iam::aws:policy/AdministratorAccess]
aws_cloudwatch_log_group.api_access_logs: Refreshing state... [id=/aws/apigateway/homepage/access-logs]
aws_iam_role_policy_attachment.api_gw_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-logs-role/arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs]
aws_api_gateway_account.main: Refreshing state... [id=659077917555]
aws_iam_role_policy_attachment.frontend_deploy: Refreshing state... [id=gh-oidc/arn:aws:iam::659077917555:policy/HomepageDeploymentPolicy]
aws_apigatewayv2_domain_name.api_domain_name: Refreshing state... [id=api.seanmeenaghan.com]
aws_iam_role_policy_attachment.lambda_basic_exec: Refreshing state... [id=lambda-default-execution-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.lambda_exec: Refreshing state... [id=lambda-default-execution-role:lambda-default-execution-policy]
aws_apigatewayv2_api_mapping.api_mapping: Refreshing state... [id=h3qh8k]
aws_apigatewayv2_stage.production: Refreshing state... [id=production]
aws_iam_role_policy.dynamodb_access: Refreshing state... [id=lambda-default-execution-role:homepage-visitor-dynamodb-access]
aws_lambda_function.visitor_api: Refreshing state... [id=visitor-api]
aws_apigatewayv2_integration.post_visitor: Refreshing state... [id=xw86kto]
aws_apigatewayv2_integration.get_visitor: Refreshing state... [id=4rerk2u]
aws_apigatewayv2_route.post_visitor: Refreshing state... [id=1sjst7h]
aws_apigatewayv2_route.get_visitor: Refreshing state... [id=on8wzih]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_servicecatalogappregistry_application.homepage will be created
  + resource "aws_servicecatalogappregistry_application" "homepage" {
      + application_tag = (known after apply)
      + arn             = (known after apply)
      + description     = "Application registry for homepage resources"
      + id              = (known after apply)
      + name            = "homepage"
      + region          = "us-west-2"
      + tags_all        = {
          + "Application" = "homepage"
          + "ManagedBy"   = "Terraform"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @s-meenaghan7, Action: `pull_request`, Workflow: `Terraform Deploy`*